

let data = {
  activityArticle: [
    {
      id: 1,
      title: "活动文章啊手动阀手动阀",
      time: 1578128612593,
      author: "wxy",
      sort: 1,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章"
    },
    {
      id: 2,
      title: "活动文章啊手动阀手动阀",
      time: 1578128612593,
      author: "wxy",
      sort: 1,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章"
    },
    {
      id: 3,
      title: "活动文章啊手动阀手动阀",
      time: 1578128612593,
      author: "wxy",
      sort: 1,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章"
    },
    {
      id: 4,
      title: "活动文章啊手动阀手动阀",
      time: 1578128612593,
      author: "wxy",
      sort: 1,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章活动文章"
    },
  ],
  companyArticle: [
    {
      id: 1,
      title: "公司新闻啊手动阀手动阀",
      time: 1576128612593,
      author: "wxy",
      sort: 2,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻"
    },
    {
      id: 2,
      title: "公司新闻啊手动阀手动阀",
      time: 1578228612593,
      author: "wxy",
      sort: 2,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻"
    },
    {
      id: 3,
      title: "公司新闻啊手动阀手动阀",
      time: 1478128612593,
      author: "wxy",
      sort: 2,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻"
    },
    {
      id: 4,
      title: "公司新闻啊手动阀手动阀",
      time: 1378128612593,
      author: "wxy",
      sort: 2,
      digest: "我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要我是摘要",
      content: "公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻公司新闻"
    },
  ]
}

function deepClone(obj) {
  // var target = {};
  // for(var key in obj) {
  //     if (Object.prototype.hasOwnProperty.call(obj, key)) {
  //         if (typeof obj[key] === 'object') {
  //             target[key] = deepClone(obj[key]); 
  //         } else {
  //             target[key] = obj[key];
  //         }
  //     }
  // }
  return JSON.parse(JSON.stringify(obj));
}

export default (() => {
  return deepClone(data);
})();